susanw1/zscript/receivers/generic-c++/zll/STM32/src/main/c++/zscript/stm32/devices/AlternateFunction/STM32L43x.h
#define TSC_G1_IO3_PB14_ PB14,GPIO_AF9
#define _TSC_G1_IO3_PB14_ 1

#define TSC_G1_IO4_PB15_ PB15,GPIO_AF9
#define _TSC_G1_IO4_PB15_ 1

#define TSC_G2_IO1_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF9
#define _TSC_G2_IO1_PB4 (NJTRST)_ 1

#define TSC_G2_IO2_PB5_ PB5,GPIO_AF9
#define _TSC_G2_IO2_PB5_ 1

#define TSC_G2_IO3_PB6_ PB6,GPIO_AF9
#define _TSC_G2_IO3_PB6_ 1

#define TSC_G2_IO4_PB7_ PB7,GPIO_AF9
#define _TSC_G2_IO4_PB7_ 1

#define TSC_G3_IO1_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF9
#define _TSC_G3_IO1_PA15 (JTDI)_ 1

#define TSC_G3_IO2_PC10_ PC10,GPIO_AF9
#define _TSC_G3_IO2_PC10_ 1

#define TSC_G3_IO3_PC11_ PC11,GPIO_AF9
#define _TSC_G3_IO3_PC11_ 1

#define TSC_G3_IO4_PC12_ PC12,GPIO_AF9
#define _TSC_G3_IO4_PC12_ 1

#define TSC_G4_IO1_PC6_ PC6,GPIO_AF9
#define _TSC_G4_IO1_PC6_ 1

#define TSC_G4_IO2_PC7_ PC7,GPIO_AF9
#define _TSC_G4_IO2_PC7_ 1

#define TSC_G4_IO3_PC8_ PC8,GPIO_AF9
#define _TSC_G4_IO3_PC8_ 1

#define TSC_G4_IO4_PC9_ PC9,GPIO_AF9
#define _TSC_G4_IO4_PC9_ 1

#define TSC_G5_IO1_PE10_ PE10,GPIO_AF9
#define _TSC_G5_IO1_PE10_ 1

#define TSC_G5_IO2_PE11_ PE11,GPIO_AF9
#define _TSC_G5_IO2_PE11_ 1

#define TSC_G5_IO3_PE12_ PE12,GPIO_AF9
#define _TSC_G5_IO3_PE12_ 1

#define TSC_G5_IO4_PE13_ PE13,GPIO_AF9
#define _TSC_G5_IO4_PE13_ 1

#define TSC_G6_IO1_PD10_ PD10,GPIO_AF9
#define _TSC_G6_IO1_PD10_ 1

#define TSC_G6_IO2_PD11_ PD11,GPIO_AF9
#define _TSC_G6_IO2_PD11_ 1

#define TSC_G6_IO3_PD12_ PD12,GPIO_AF9
#define _TSC_G6_IO3_PD12_ 1

#define TSC_G6_IO4_PD13_ PD13,GPIO_AF9
#define _TSC_G6_IO4_PD13_ 1

#define TSC_G7_IO1_PE2_ PE2,GPIO_AF9
#define _TSC_G7_IO1_PE2_ 1

#define TSC_G7_IO2_PE3_ PE3,GPIO_AF9
#define _TSC_G7_IO2_PE3_ 1

#define TSC_G7_IO3_PE4_ PE4,GPIO_AF9
#define _TSC_G7_IO3_PE4_ 1

#define TSC_G7_IO4_PE5_ PE5,GPIO_AF9
#define _TSC_G7_IO4_PE5_ 1

#define TSC_SYNC_PB10_ PB10,GPIO_AF9
#define TSC_SYNC_PD2_ PD2,GPIO_AF9
#define _TSC_SYNC_PB10_ 1
#define _TSC_SYNC_PD2_ 1

#define UART1_CK_PA8_ PA8,GPIO_AF7
#define UART1_CK_PB5_ PB5,GPIO_AF7
#define _UART1_CK_PA8_ 1
#define _UART1_CK_PB5_ 1

#define UART1_CTS_PA11_ PA11,GPIO_AF7
#define UART1_CTS_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF7
#define _UART1_CTS_PA11_ 1
#define _UART1_CTS_PB4 (NJTRST)_ 1

#define UART1_DE_PA12_ PA12,GPIO_AF7
#define UART1_DE_PB3 (JTDO_ PB3 (JTDO,GPIO_AF7
#define _UART1_DE_PA12_ 1
#define _UART1_DE_PB3 (JTDO_ 1

#define UART1_RTS_PA12_ PA12,GPIO_AF7
#define UART1_RTS_PB3 (JTDO_ PB3 (JTDO,GPIO_AF7
#define _UART1_RTS_PA12_ 1
#define _UART1_RTS_PB3 (JTDO_ 1

#define UART1_RX_PA10_ PA10,GPIO_AF7
#define UART1_RX_PB7_ PB7,GPIO_AF7
#define _UART1_RX_PA10_ 1
#define _UART1_RX_PB7_ 1

#define UART1_TX_PA9_ PA9,GPIO_AF7
#define UART1_TX_PB6_ PB6,GPIO_AF7
#define _UART1_TX_PA9_ 1
#define _UART1_TX_PB6_ 1

#define UART2_CK_PA4_ PA4,GPIO_AF7
#define UART2_CK_PD7_ PD7,GPIO_AF7
#define _UART2_CK_PA4_ 1
#define _UART2_CK_PD7_ 1

#define UART2_CTS_PA0_ PA0,GPIO_AF7
#define UART2_CTS_PD3_ PD3,GPIO_AF7
#define _UART2_CTS_PA0_ 1
#define _UART2_CTS_PD3_ 1

#define UART2_DE_PA1_ PA1,GPIO_AF7
#define UART2_DE_PD4_ PD4,GPIO_AF7
#define _UART2_DE_PA1_ 1
#define _UART2_DE_PD4_ 1

#define UART2_RTS_PA1_ PA1,GPIO_AF7
#define UART2_RTS_PD4_ PD4,GPIO_AF7
#define _UART2_RTS_PA1_ 1
#define _UART2_RTS_PD4_ 1

#define UART2_RX_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF3
#define UART2_RX_PA3_ PA3,GPIO_AF7
#define UART2_RX_PD6_ PD6,GPIO_AF7
#define _UART2_RX_PA15 (JTDI)_ 1
#define _UART2_RX_PA3_ 1
#define _UART2_RX_PD6_ 1

#define UART2_TX_PA2_ PA2,GPIO_AF7
#define UART2_TX_PD5_ PD5,GPIO_AF7
#define _UART2_TX_PA2_ 1
#define _UART2_TX_PD5_ 1

#define UART3_CK_PB0_ PB0,GPIO_AF7
#define UART3_CK_PB12_ PB12,GPIO_AF7
#define UART3_CK_PC12_ PC12,GPIO_AF7
#define UART3_CK_PD10_ PD10,GPIO_AF7
#define _UART3_CK_PB0_ 1
#define _UART3_CK_PB12_ 1
#define _UART3_CK_PC12_ 1
#define _UART3_CK_PD10_ 1

#define UART3_CTS_PA6_ PA6,GPIO_AF7
#define UART3_CTS_PB13_ PB13,GPIO_AF7
#define UART3_CTS_PD11_ PD11,GPIO_AF7
#define _UART3_CTS_PA6_ 1
#define _UART3_CTS_PB13_ 1
#define _UART3_CTS_PD11_ 1

#define UART3_DE_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF7
#define UART3_DE_PB1_ PB1,GPIO_AF7
#define UART3_DE_PB14_ PB14,GPIO_AF7
#define UART3_DE_PD12_ PD12,GPIO_AF7
#define UART3_DE_PD2_ PD2,GPIO_AF7
#define _UART3_DE_PA15 (JTDI)_ 1
#define _UART3_DE_PB1_ 1
#define _UART3_DE_PB14_ 1
#define _UART3_DE_PD12_ 1
#define _UART3_DE_PD2_ 1

#define UART3_RTS_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF7
#define UART3_RTS_PB1_ PB1,GPIO_AF7
#define UART3_RTS_PB14_ PB14,GPIO_AF7
#define UART3_RTS_PD12_ PD12,GPIO_AF7
#define UART3_RTS_PD2_ PD2,GPIO_AF7
#define _UART3_RTS_PA15 (JTDI)_ 1
#define _UART3_RTS_PB1_ 1
#define _UART3_RTS_PB14_ 1
#define _UART3_RTS_PD12_ 1
#define _UART3_RTS_PD2_ 1

#define UART3_RX_PB11_ PB11,GPIO_AF7
#define UART3_RX_PC11_ PC11,GPIO_AF7
#define UART3_RX_PC5_ PC5,GPIO_AF7
#define UART3_RX_PD9_ PD9,GPIO_AF7
#define _UART3_RX_PB11_ 1
#define _UART3_RX_PC11_ 1
#define _UART3_RX_PC5_ 1
#define _UART3_RX_PD9_ 1

#define UART3_TX_PB10_ PB10,GPIO_AF7
#define UART3_TX_PC10_ PC10,GPIO_AF7
#define UART3_TX_PC4_ PC4,GPIO_AF7
#define UART3_TX_PD8_ PD8,GPIO_AF7
#define _UART3_TX_PB10_ 1
#define _UART3_TX_PC10_ 1
#define _UART3_TX_PC4_ 1
#define _UART3_TX_PD8_ 1

#define UART4_CTS_PA6_ PA6,GPIO_AF8
#define UART4_CTS_PB13_ PB13,GPIO_AF8
#define _UART4_CTS_PA6_ 1
#define _UART4_CTS_PB13_ 1

#define UART4_DE_PB1_ PB1,GPIO_AF8
#define UART4_DE_PB12_ PB12,GPIO_AF8
#define _UART4_DE_PB1_ 1
#define _UART4_DE_PB12_ 1

#define UART4_RTS_PB1_ PB1,GPIO_AF8
#define UART4_RTS_PB12_ PB12,GPIO_AF8
#define _UART4_RTS_PB1_ 1
#define _UART4_RTS_PB12_ 1

#define UART4_RX_PA3_ PA3,GPIO_AF8
#define UART4_RX_PB10_ PB10,GPIO_AF8
#define UART4_RX_PC0_ PC0,GPIO_AF8
#define _UART4_RX_PA3_ 1
#define _UART4_RX_PB10_ 1
#define _UART4_RX_PC0_ 1

#define UART4_TX_PA2_ PA2,GPIO_AF8
#define UART4_TX_PB11_ PB11,GPIO_AF8
#define UART4_TX_PC1_ PC1,GPIO_AF8
#define _UART4_TX_PA2_ 1
#define _UART4_TX_PB11_ 1
#define _UART4_TX_PC1_ 1

#define USART1_CK_PA8_ PA8,GPIO_AF7
#define USART1_CK_PB5_ PB5,GPIO_AF7
#define _USART1_CK_PA8_ 1
#define _USART1_CK_PB5_ 1

